neoluxis/STM32HAL/STM32_Hanja/PID/FinalWork/PID电机调速/Hardware/OLED.h
//////////////////////////////////////////////////////////////////////////////////	 
//
//  τ ݾ Ļ   : main.c
//  ٦ŜĨ˶   : OLED ޓࠚҝʾ}Ԍ
//              ˵ķ: 
//              ----------------------------------------------------------------
//              VCC  ޓ5Vܲ3.3v֧Դ
//              GND  ֧Դ֘
//              D1   ޓPB15èSDAé
//              D0   ޓPB13èSCLé
//              CS   ޓPB12    
//              RST  ޓϵͳشλ
//              DC   ޓPC6
//              NC   Ѽࠕ          
//              ----------------------------------------------------------------
//******************************************************************************/

#ifndef __OLED_H
#define __OLED_H		
#include "stm32f10x.h"                  // Device header
   	
//OLEDģʽʨ׃
//0:4ПԮѐģʽ
//1:Ңѐ8080ģʽ
#define OLED_MODE 0
#define SIZE 16
#define XLevelL		0x00
#define XLevelH		0x10
#define Max_Column	128
#define Max_Row		64
#define	Brightness	0xFF 
#define X_WIDTH 	128
#define Y_WIDTH 	64	    						  
//-----------------OLED׋ࠚ֨ӥ----------------  					   
#define OLED_CS_Clr()  GPIO_ResetBits(GPIOB,GPIO_Pin_12)//CS
#define OLED_CS_Set()  GPIO_SetBits(GPIOB,GPIO_Pin_12)

#define OLED_RST_Clr() GPIO_ResetBits(GPIOA,GPIO_Pin_4)//RES
#define OLED_RST_Set() GPIO_SetBits(GPIOA,GPIO_Pin_4)

#define OLED_DC_Clr() GPIO_ResetBits(GPIOC,GPIO_Pin_6)//DC
#define OLED_DC_Set() GPIO_SetBits(GPIOC,GPIO_Pin_6)

#define OLED_SCLK_Clr() GPIO_ResetBits(GPIOB,GPIO_Pin_13)//CLK
#define OLED_SCLK_Set() GPIO_SetBits(GPIOB,GPIO_Pin_13)

#define OLED_SDIN_Clr() GPIO_ResetBits(GPIOB,GPIO_Pin_15)//DIN
#define OLED_SDIN_Set() GPIO_SetBits(GPIOB,GPIO_Pin_15)

 
//PC0~7,طΪ˽ߝП
#define DATAOUT(x) GPIO_Write(GPIOC,x);//ˤԶ  
//ʹԃ4ПԮѐޓࠚʱʹԃ 


#define OLED_CMD  0	//дļ®
#define OLED_DATA 1	//д˽ߝ


//OLED࠘׆ԃگ˽
void OLED_WR_Byte(uint8_t dat,uint8_t cmd);	    
void OLED_Display_On(void);
void OLED_Display_Off(void);	   							   		    
void OLED_Init(void);
void OLED_Clear(void);
void OLED_DrawPoint(uint8_t x,uint8_t y,uint8_t t);
void OLED_Fill(uint8_t x1,uint8_t y1,uint8_t x2,uint8_t y2,uint8_t dot);
void OLED_ShowChar(uint8_t x,uint8_t y,uint8_t chr);
void OLED_ShowNum(uint8_t x,uint8_t y,uint32_t num,uint8_t len,uint8_t size);
void OLED_ShowString(uint8_t x,uint8_t y, uint8_t *p);	 
void OLED_Set_Pos(unsigned char x, unsigned char y);
void OLED_ShowCHinese(uint8_t x,uint8_t y,uint8_t no);
void OLED_DrawBMP(unsigned char x0, unsigned char y0,unsigned char x1, unsigned char y1,unsigned char BMP[]);
#endif  
	 
